InformationRegisters/НалогообложениеНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НалогообложениеНачислений</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияИПН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюИПН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияОПВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюОПВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюСН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияСО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияОППВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюОППВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияВОСМС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюВОСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияООСМС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюООСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияЕП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюЕП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияОПВР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюОПВР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДивидендов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыВыплатБывшимСотрудникам</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихДоходовФизическихЛиц</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НалогообложениеНачислений/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если СтрокаНабора.ВидДохода = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства
			И НЕ ТипЗнч(СтрокаНабора.Начисление) = Тип("СправочникСсылка.ВидыПрочихДоходовФизическихЛиц") Тогда
			
			ВызватьИсключение НСтр("ru = 'Расчет по виду дохода ""Доход субъекта предпринимательства"" производится через элементы справочника ""Виды прочих доходов"".'");
			
		КонецЕсли;
		
		Если СтрокаНабора.Период < Дата('20210101') Тогда
			
			Если СтрокаНабора.ВидДохода = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства Тогда
				
				ВызватьИсключение НСтр("ru = 'Расчет по виду дохода ""Доход субъекта предпринимательства"" доступен с 2021 года.'");
				
			КонецЕсли;
				
		КонецЕсли;

		Если СтрокаНабора.Период < Дата('20230101') Тогда
			
			Если ЗначениеЗаполнено(СтрокаНабора.СпособОбложенияЕП)
				ИЛИ ЗначениеЗаполнено(СтрокаНабора.ДоходНеПодлежащийНалогообложениюЕП) Тогда
				
				ВызватьИсключение НСтр("ru = 'Установка параметров налогообложения единым платежом доступны в настройках учетной политики с 2023 года.'");
				
			КонецЕсли;
			
		КонецЕсли;

		Если СтрокаНабора.Период < Дата('20240101') Тогда
			
			Если ЗначениеЗаполнено(СтрокаНабора.СпособОбложенияОПВР)
				ИЛИ ЗначениеЗаполнено(СтрокаНабора.ДоходНеПодлежащийНалогообложениюОПВР) Тогда
				
				ВызватьИсключение НСтр("ru = 'Установка параметров налогообложения обязательными пенсионными взносами работодателя доступны в настройках учетной политики с 2024 года.'");
				
			КонецЕсли;
			
		КонецЕсли;

		Если СтрокаНабора.Период < Дата('20250101') Тогда
			
			Если СтрокаНабора.ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента")
				И (ЗначениеЗаполнено(СтрокаНабора.СпособОбложенияСО)
				ИЛИ ЗначениеЗаполнено(СтрокаНабора.ДоходНеПодлежащийНалогообложениюСО)) Тогда
				
				ВызватьИсключение НСтр("ru = 'Установка параметров налогообложения социальными отчислениями для доходов от налогового агента доступна в настройках учетной политики с 2025 года.'");
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
	// Обновляем кэш платформы для зачитывания актуальных настроек
	// используется в ОтражениеЗарплатыВУчетеПовтИсп.ТаблицаНачислениеУдержаниеВидОперации.
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецЕсли
